# Example 2

Insert data in specific columns

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# It is also possible to only insert data in specific columns.
# The following SQL statement will insert a new record, but only insert data in the "CustomerName", "City", and "Country" columns.
query = '''
            INSERT INTO Customers   (CustomerID, CustomerName, City, Country) VALUES 
                                    (92, 'Cardinal', 'Stavanger', 'Norway')
        '''
cur.execute(query);

## Show table

In [4]:
query = '''
            SELECT * 
            FROM Customers
        '''
df = pd.read_sql_query(query, con)
df.tail()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland
91,92,Cardinal,None,None,Stavanger,None,Norway

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    92 non-null     int64
 1   CustomerName  92 non-null     object
 2   ContactName   91 non-null     object
 3   Address       91 non-null     object
 4   City          92 non-null     object
 5   PostalCode    91 non-null     object
 6   Country       92 non-null     object
dtypes: int64(1), object(6)
memory usage: 5.2+ KB

## Close the connection

In [6]:
con.close()